---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.TargetRebarConstraintType.StartOfBar
enum: Autodesk.Revit.DB.Structure.TargetRebarConstraintType
source: html/b5eb20bf-e887-41b4-f15c-0c1860799a8b.htm
---
# Autodesk.Revit.DB.Structure.TargetRebarConstraintType.StartOfBar

Handle is constrained to start point of the other Rebar.